app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found"
    elsif params[:artist_id] && Artist.exists?(params[:artist_id])
      @artist = Artist.find_by(id: params[:artist_id])
      if Song.exists?(params[:id])
        @song = Song.find_by(id: params[:id])